Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg51/edc/ATSAMG51N18.PIC
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x40010070"/>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC_CHANNEL2TC0_CCR" edc:nzwidth="0x20" edc:access="-----------------------------www" edc:impl="0x7" edc:_addr="0x40010080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="CLKEN" edc:nzwidth="0x1" edc:desc="Counter Clock Enable Command"/>
            <edc:SFRFieldDef edc:cname="CLKDIS" edc:nzwidth="0x1" edc:desc="Counter Clock Disable Command"/>
            <edc:SFRFieldDef edc:cname="SWTRG" edc:nzwidth="0x1" edc:desc="Software Trigger Command"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC_CHANNEL2TC0_CMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40010084">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="TCCLKS" edc:nzwidth="0x3" edc:desc="Clock Selection">
              <edc:SFRFieldSemantic edc:cname="TIMER_CLOCK1" edc:desc="Clock selected: internal TIMER_CLOCK1 clock signal (from PMC)" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TIMER_CLOCK2" edc:desc="Clock selected: internal TIMER_CLOCK2 clock signal (from PMC)" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="TIMER_CLOCK3" edc:desc="Clock selected: internal TIMER_CLOCK3 clock signal (from PMC)" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="TIMER_CLOCK4" edc:desc="Clock selected: internal TIMER_CLOCK4 clock signal (from PMC)" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="TIMER_CLOCK5" edc:desc="Clock selected: internal TIMER_CLOCK5 clock signal (from PMC)" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="XC0" edc:desc="Clock selected: XC0" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="XC1" edc:desc="Clock selected: XC1" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="XC2" edc:desc="Clock selected: XC2" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CLKI" edc:nzwidth="0x1" edc:desc="Clock Invert"/>
            <edc:SFRFieldDef edc:cname="BURST" edc:nzwidth="0x2" edc:desc="Burst Signal Selection">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="The clock is not gated by an external signal." edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="XC0" edc:desc="XC0 is ANDed with the selected clock." edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="XC1" edc:desc="XC1 is ANDed with the selected clock." edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="XC2" edc:desc="XC2 is ANDed with the selected clock." edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPCSTOP" edc:nzwidth="0x1" edc:desc="Counter Clock Stopped with RC Compare"/>
            <edc:SFRFieldDef edc:cname="CPCDIS" edc:nzwidth="0x1" edc:desc="Counter Clock Disable with RC Loading"/>
            <edc:SFRFieldDef edc:cname="EEVTEDG" edc:nzwidth="0x2" edc:desc="External Event Edge Selection">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="None" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="RISING" edc:desc="Rising edge" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FALLING" edc:desc="Falling edge" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="EDGE" edc:desc="Each edges" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EEVT" edc:nzwidth="0x2" edc:desc="External Event Selection">
              <edc:SFRFieldSemantic edc:cname="TIOB" edc:desc="TIOB" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="XC0" edc:desc="XC0" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="XC1" edc:desc="XC1" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="XC2" edc:desc="XC2" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ENETRG" edc:nzwidth="0x1" edc:desc="External Event Trigger Enable"/>
            <edc:SFRFieldDef edc:cname="WAVSEL" edc:nzwidth="0x2" edc:desc="Waveform Selection">
              <edc:SFRFieldSemantic edc:cname="UP" edc:desc="UP mode without automatic trigger on RC Compare" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="UPDOWN" edc:desc="UPDOWN mode without automatic trigger on RC Compare" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="UP_RC" edc:desc="UP mode with automatic trigger on RC Compare" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="UPDOWN_RC" edc:desc="UPDOWN mode with automatic trigger on RC Compare" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="-1"/>
            <edc:SFRFieldDef edc:cname="CPCTRG" edc:nzwidth="0x1" edc:desc="RC Compare Trigger Enable"/>
            <edc:SFRFieldDef edc:cname="WAVE" edc:nzwidth="0x1" edc:desc="Waveform Mode"/>
            <edc:SFRFieldDef edc:cname="ACPA" edc:nzwidth="0x2" edc:desc="RA Compare Effect on TIOAx">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="NONE" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="SET" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="CLEAR" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="TOGGLE" edc:desc="TOGGLE" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACPC" edc:nzwidth="0x2" edc:desc="RC Compare Effect on TIOAx">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="NONE" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="SET" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="CLEAR" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="TOGGLE" edc:desc="TOGGLE" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AEEVT" edc:nzwidth="0x2" edc:desc="External Event Effect on TIOAx">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="NONE" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="SET" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="CLEAR" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="TOGGLE" edc:desc="TOGGLE" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ASWTRG" edc:nzwidth="0x2" edc:desc="Software Trigger Effect on TIOAx">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="NONE" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="SET" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="CLEAR" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="TOGGLE" edc:desc="TOGGLE" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BCPB" edc:nzwidth="0x2" edc:desc="RB Compare Effect on TIOBx">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="NONE" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="SET" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="CLEAR" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="TOGGLE" edc:desc="TOGGLE" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BCPC" edc:nzwidth="0x2" edc:desc="RC Compare Effect on TIOBx">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="NONE" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="SET" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="CLEAR" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="TOGGLE" edc:desc="TOGGLE" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BEEVT" edc:nzwidth="0x2" edc:desc="External Event Effect on TIOBx">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="NONE" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="SET" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="CLEAR" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="TOGGLE" edc:desc="TOGGLE" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BSWTRG" edc:nzwidth="0x2" edc:desc="Software Trigger Effect on TIOBx">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="NONE" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="SET" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="CLEAR" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="TOGGLE" edc:desc="TOGGLE" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC_CHANNEL2TC0_SMMR" edc:nzwidth="0x20" edc:access="------------------------------nn" edc:impl="0x3" edc:_addr="0x40010088">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="GCEN" edc:nzwidth="0x1" edc:desc="Gray Count Enable"/>
            <edc:SFRFieldDef edc:cname="DOWN" edc:nzwidth="0x1" edc:desc="Down Count"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x4001008C"/>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC_CHANNEL2TC0_CV" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x40010090">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="CV" edc:nzwidth="0x20" edc:desc="Counter Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC_CHANNEL2TC0_RA" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40010094">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="RA" edc:nzwidth="0x20" edc:desc="Register A"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC_CHANNEL2TC0_RB" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40010098">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="RB" edc:nzwidth="0x20" edc:desc="Register B"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC_CHANNEL2TC0_RC" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x4001009C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="RC" edc:nzwidth="0x20" edc:desc="Register C"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC_CHANNEL2TC0_SR" edc:nzwidth="0x20" edc:access="-------------rrr------rrrrrrrrrr" edc:impl="0x703FF" edc:_addr="0x400100A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="COVFS" edc:nzwidth="0x1" edc:desc="Counter Overflow Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:nzwidth="0x1" edc:desc="Load Overrun Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:nzwidth="0x1" edc:desc="RA Compare Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:nzwidth="0x1" edc:desc="RB Compare Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:nzwidth="0x1" edc:desc="RC Compare Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:nzwidth="0x1" edc:desc="RA Loading Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:nzwidth="0x1" edc:desc="RB Loading Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:nzwidth="0x1" edc:desc="External Trigger Status (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receiver Transfer (cleared by writing TC_RCR or TC_RNCR)"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Reception Buffer Full (cleared by writing TC_RCR or TC_RNCR)"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="CLKSTA" edc:nzwidth="0x1" edc:desc="Clock Enabling Status"/>
            <edc:SFRFieldDef edc:cname="MTIOA" edc:nzwidth="0x1" edc:desc="TIOA Mirror"/>
            <edc:SFRFieldDef edc:cname="MTIOB" edc:nzwidth="0x1" edc:desc="TIOB Mirror"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC_CHANNEL2TC0_IER" edc:nzwidth="0x20" edc:access="----------------------wwwwwwwwww" edc:impl="0x3FF" edc:_addr="0x400100A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="COVFS" edc:nzwidth="0x1" edc:desc="Counter Overflow"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:nzwidth="0x1" edc:desc="Load Overrun"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:nzwidth="0x1" edc:desc="RA Compare"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:nzwidth="0x1" edc:desc="RB Compare"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:nzwidth="0x1" edc:desc="RC Compare"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:nzwidth="0x1" edc:desc="RA Loading"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:nzwidth="0x1" edc:desc="RB Loading"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:nzwidth="0x1" edc:desc="External Trigger"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receiver Transfer"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Reception Buffer Full"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC_CHANNEL2TC0_IDR" edc:nzwidth="0x20" edc:access="----------------------wwwwwwwwww" edc:impl="0x3FF" edc:_addr="0x400100A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="COVFS" edc:nzwidth="0x1" edc:desc="Counter Overflow"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:nzwidth="0x1" edc:desc="Load Overrun"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:nzwidth="0x1" edc:desc="RA Compare"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:nzwidth="0x1" edc:desc="RB Compare"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:nzwidth="0x1" edc:desc="RC Compare"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:nzwidth="0x1" edc:desc="RA Loading"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:nzwidth="0x1" edc:desc="RB Loading"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:nzwidth="0x1" edc:desc="External Trigger"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receiver Transfer"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Reception Buffer Full"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC_CHANNEL2TC0_IMR" edc:nzwidth="0x20" edc:access="----------------------rrrrrrrrrr" edc:impl="0x3FF" edc:_addr="0x400100AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="COVFS" edc:nzwidth="0x1" edc:desc="Counter Overflow"/>
            <edc:SFRFieldDef edc:cname="LOVRS" edc:nzwidth="0x1" edc:desc="Load Overrun"/>
            <edc:SFRFieldDef edc:cname="CPAS" edc:nzwidth="0x1" edc:desc="RA Compare"/>
            <edc:SFRFieldDef edc:cname="CPBS" edc:nzwidth="0x1" edc:desc="RB Compare"/>
            <edc:SFRFieldDef edc:cname="CPCS" edc:nzwidth="0x1" edc:desc="RC Compare"/>
            <edc:SFRFieldDef edc:cname="LDRAS" edc:nzwidth="0x1" edc:desc="RA Loading"/>
            <edc:SFRFieldDef edc:cname="LDRBS" edc:nzwidth="0x1" edc:desc="RB Loading"/>
            <edc:SFRFieldDef edc:cname="ETRGS" edc:nzwidth="0x1" edc:desc="External Trigger"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of Receiver Transfer"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="Reception Buffer Full"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x400100B0"/>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC0_BCR" edc:nzwidth="0x20" edc:access="-------------------------------w" edc:impl="0x1" edc:_addr="0x400100C0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="SYNC" edc:nzwidth="0x1" edc:desc="Synchro Command"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC0_BMR" edc:nzwidth="0x20" edc:access="--------------------------nnnnnn" edc:impl="0x3F" edc:_addr="0x400100C4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="TC0XC0S" edc:nzwidth="0x2" edc:desc="External Clock Signal 0 Selection">
              <edc:SFRFieldSemantic edc:cname="TCLK0" edc:desc="Signal connected to XC0: TCLK0" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TIOA1" edc:desc="Signal connected to XC0: TIOA1" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="TIOA2" edc:desc="Signal connected to XC0: TIOA2" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TC1XC1S" edc:nzwidth="0x2" edc:desc="External Clock Signal 1 Selection">
              <edc:SFRFieldSemantic edc:cname="TCLK1" edc:desc="Signal connected to XC1: TCLK1" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TIOA0" edc:desc="Signal connected to XC1: TIOA0" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="TIOA2" edc:desc="Signal connected to XC1: TIOA2" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TC2XC2S" edc:nzwidth="0x2" edc:desc="External Clock Signal 2 Selection">
              <edc:SFRFieldSemantic edc:cname="TCLK2" edc:desc="Signal connected to XC2: TCLK2" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="TIOA0" edc:desc="Signal connected to XC2: TIOA0" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="TIOA1" edc:desc="Signal connected to XC2: TIOA1" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1C" edc:_addr="0x400100C8"/>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC0_WPMR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:impl="0xFFFFFF01" edc:_addr="0x400100E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:nzwidth="0x1" edc:desc="Write Protection Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:nzwidth="0x18" edc:desc="Write Protection Key">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x54494D"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x98" edc:_addr="0x400100E8"/>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC0_RPR2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40010180">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="RXPTR" edc:nzwidth="0x20" edc:desc="Receive Pointer Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x40010184"/>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC0_RNPR2" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40010190">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="RXNPTR" edc:nzwidth="0x20" edc:desc="Receive Next Pointer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TC0" edc:cname="TC0_RNCR2" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40010194">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC0">
            <edc:SFRFieldDef edc:cname="RXNCTR" edc:nzwidth="0x10" edc:desc="Receive Next Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
