Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg51/edc/ATSAMG51N18.PIC
      <edc:AdjustPoint edc:offset="0x3ED8" edc:_addr="0x40018128"/>
      <edc:SFRDef ltx:memberofperipheral="TWI1" edc:cname="TWI1_CR" edc:nzwidth="0x20" edc:access="------------------------wwwwwwww" edc:impl="0xFF" edc:_addr="0x4001C000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI1">
            <edc:SFRFieldDef edc:cname="START" edc:nzwidth="0x1" edc:desc="Send a START Condition"/>
            <edc:SFRFieldDef edc:cname="STOP" edc:nzwidth="0x1" edc:desc="Send a STOP Condition"/>
            <edc:SFRFieldDef edc:cname="MSEN" edc:nzwidth="0x1" edc:desc="TWI Master Mode Enabled"/>
            <edc:SFRFieldDef edc:cname="MSDIS" edc:nzwidth="0x1" edc:desc="TWI Master Mode Disabled"/>
            <edc:SFRFieldDef edc:cname="SVEN" edc:nzwidth="0x1" edc:desc="TWI Slave Mode Enabled"/>
            <edc:SFRFieldDef edc:cname="SVDIS" edc:nzwidth="0x1" edc:desc="TWI Slave Mode Disabled"/>
            <edc:SFRFieldDef edc:cname="QUICK" edc:nzwidth="0x1" edc:desc="SMBus Quick Command"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TWI1" edc:cname="TWI1_MMR" edc:nzwidth="0x20" edc:access="---------nnnnnnn---n--nn--------" edc:impl="0x7F1300" edc:_addr="0x4001C004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI1">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="IADRSZ" edc:nzwidth="0x2" edc:desc="Internal Device Address Size">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No internal device address" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="_1_BYTE" edc:desc="One-byte internal device address" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="_2_BYTE" edc:desc="Two-byte internal device address" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="_3_BYTE" edc:desc="Three-byte internal device address" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MREAD" edc:nzwidth="0x1" edc:desc="Master Read Direction"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DADR" edc:nzwidth="0x7" edc:desc="Device Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TWI1" edc:cname="TWI1_SMR" edc:nzwidth="0x20" edc:access="---------nnnnnnn----------------" edc:impl="0x7F0000" edc:_addr="0x4001C008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI1">
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="SADR" edc:nzwidth="0x7" edc:desc="Slave Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TWI1" edc:cname="TWI1_IADR" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFF" edc:_addr="0x4001C00C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI1">
            <edc:SFRFieldDef edc:cname="IADR" edc:nzwidth="0x18" edc:desc="Internal Address"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TWI1" edc:cname="TWI1_CWGR" edc:nzwidth="0x20" edc:access="---nnnnn-----nnnnnnnnnnnnnnnnnnn" edc:impl="0x1F07FFFF" edc:_addr="0x4001C010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI1">
            <edc:SFRFieldDef edc:cname="CLDIV" edc:nzwidth="0x8" edc:desc="Clock Low Divider"/>
            <edc:SFRFieldDef edc:cname="CHDIV" edc:nzwidth="0x8" edc:desc="Clock High Divider"/>
            <edc:SFRFieldDef edc:cname="CKDIV" edc:nzwidth="0x3" edc:desc="Clock Divider"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="HOLD" edc:nzwidth="0x5" edc:desc="TWD Hold Time versus TWCK falling"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x4001C014"/>
      <edc:SFRDef ltx:memberofperipheral="TWI1" edc:cname="TWI1_SR" edc:nzwidth="0x20" edc:access="----------------rrrrrrrr-rrrrrrr" edc:impl="0xFF7F" edc:_addr="0x4001C020">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWI1">
            <edc:SFRFieldDef edc:cname="TXCOMP" edc:nzwidth="0x1" edc:desc="Transmission Completed (cleared by writing TWI_THR)"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:nzwidth="0x1" edc:desc="Receive Holding Register Ready (cleared by reading TWI_RHR)"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:nzwidth="0x1" edc:desc="Transmit Holding Register Ready (cleared by writing TWI_THR)"/>
            <edc:SFRFieldDef edc:cname="SVREAD" edc:nzwidth="0x1" edc:desc="Slave Read"/>
            <edc:SFRFieldDef edc:cname="SVACC" edc:nzwidth="0x1" edc:desc="Slave Access"/>
            <edc:SFRFieldDef edc:cname="GACC" edc:nzwidth="0x1" edc:desc="General Call Access (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:nzwidth="0x1" edc:desc="Overrun Error (cleared on read)"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:nzwidth="0x1" edc:desc="Not Acknowledged (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="ARBLST" edc:nzwidth="0x1" edc:desc="Arbitration Lost (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="SCLWS" edc:nzwidth="0x1" edc:desc="Clock Wait State"/>
            <edc:SFRFieldDef edc:cname="EOSACC" edc:nzwidth="0x1" edc:desc="End Of Slave Access (cleared on read)"/>
            <edc:SFRFieldDef edc:cname="ENDRX" edc:nzwidth="0x1" edc:desc="End of RX buffer (cleared by writing TWI_RCR or TWI_RNCR)"/>
            <edc:SFRFieldDef edc:cname="ENDTX" edc:nzwidth="0x1" edc:desc="End of TX buffer (cleared by writing TWI_TCR or TWI_TNCR)"/>
            <edc:SFRFieldDef edc:cname="RXBUFF" edc:nzwidth="0x1" edc:desc="RX Buffer Full (cleared by writing TWI_RCR or TWI_RNCR)"/>
            <edc:SFRFieldDef edc:cname="TXBUFE" edc:nzwidth="0x1" edc:desc="TX Buffer Empty (cleared by writing TWI_TCR or TWI_TNCR)"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
