Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg51/edc/ATSAMG51N18.PIC
      <edc:SFRDef ltx:memberofperipheral="MEM2MEM" edc:cname="MEM2MEM_TPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40028108">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MEM2MEM">
            <edc:SFRFieldDef edc:cname="TXPTR" edc:nzwidth="0x20" edc:desc="Transmit Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MEM2MEM" edc:cname="MEM2MEM_TCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x4002810C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MEM2MEM">
            <edc:SFRFieldDef edc:cname="TXCTR" edc:nzwidth="0x10" edc:desc="Transmit Counter Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MEM2MEM" edc:cname="MEM2MEM_RNPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40028110">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MEM2MEM">
            <edc:SFRFieldDef edc:cname="RXNPTR" edc:nzwidth="0x20" edc:desc="Receive Next Pointer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MEM2MEM" edc:cname="MEM2MEM_RNCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x40028114">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MEM2MEM">
            <edc:SFRFieldDef edc:cname="RXNCTR" edc:nzwidth="0x10" edc:desc="Receive Next Counter"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MEM2MEM" edc:cname="MEM2MEM_TNPR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x40028118">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MEM2MEM">
            <edc:SFRFieldDef edc:cname="TXNPTR" edc:nzwidth="0x20" edc:desc="Transmit Next Pointer"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MEM2MEM" edc:cname="MEM2MEM_TNCR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x4002811C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MEM2MEM">
            <edc:SFRFieldDef edc:cname="TXNCTR" edc:nzwidth="0x10" edc:desc="Transmit Counter Next"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MEM2MEM" edc:cname="MEM2MEM_PTCR" edc:nzwidth="0x20" edc:access="----------------------ww------ww" edc:impl="0x303" edc:_addr="0x40028120">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MEM2MEM">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:nzwidth="0x1" edc:desc="Receiver Transfer Enable"/>
            <edc:SFRFieldDef edc:cname="RXTDIS" edc:nzwidth="0x1" edc:desc="Receiver Transfer Disable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:nzwidth="0x1" edc:desc="Transmitter Transfer Enable"/>
            <edc:SFRFieldDef edc:cname="TXTDIS" edc:nzwidth="0x1" edc:desc="Transmitter Transfer Disable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MEM2MEM" edc:cname="MEM2MEM_PTSR" edc:nzwidth="0x20" edc:access="-----------------------r-------r" edc:impl="0x101" edc:_addr="0x40028124">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MEM2MEM">
            <edc:SFRFieldDef edc:cname="RXTEN" edc:nzwidth="0x1" edc:desc="Receiver Transfer Enable"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="TXTEN" edc:nzwidth="0x1" edc:desc="Transmitter Transfer Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xFED8" edc:_addr="0x40028128"/>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_CR" edc:nzwidth="0x20" edc:access="----------------------------w-ww" edc:impl="0xB" edc:_addr="0x40038000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="START" edc:nzwidth="0x1" edc:desc="Start Conversion"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="AUTOCAL" edc:nzwidth="0x1" edc:desc="Automatic Calibration of ADC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_MR" edc:nzwidth="0x20" edc:access="nnnnnnnn-n--nnnnnnnnnnnnn-nnnnnn" edc:impl="0xFF4FFFBF" edc:_addr="0x40038004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="TRGEN" edc:nzwidth="0x1" edc:desc="Trigger Enable">
              <edc:SFRFieldSemantic edc:cname="DIS" edc:desc="Hardware triggers are disabled. Starting a conversion is only possible by software." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="EN" edc:desc="Hardware trigger selected by TRGSEL field is enabled." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TRGSEL" edc:nzwidth="0x3" edc:desc="Trigger Selection">
              <edc:SFRFieldSemantic edc:cname="ADC_TRIG0" edc:desc="External trigger" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ADC_TRIG1" edc:desc="TIO Output of the Timer Counter Channel 0" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="ADC_TRIG2" edc:desc="TIO Output of the Timer Counter Channel 1" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="ADC_TRIG3" edc:desc="TIO Output of the Timer Counter Channel 2" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="ADC_TRIG4" edc:desc="RTCOUT0" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="ADC_TRIG5" edc:desc="RTTINC" edc:when="(field &amp; 0x7) == 0x05"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LOWRES" edc:nzwidth="0x1" edc:desc="Resolution">
              <edc:SFRFieldSemantic edc:cname="BITS_10" edc:desc="10-bit resolution. For higher resolution by averaging, please refer to &quot;ADC Extended Mode Register&quot; on page 77." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="BITS_8" edc:desc="8-bit resolution" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SLEEP" edc:nzwidth="0x1" edc:desc="Sleep Mode">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal Mode: The ADC core and reference voltage circuitry are kept ON between conversions." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SLEEP" edc:desc="Sleep Mode: The ADC core and reference voltage circuitry are OFF between conversions." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FREERUN" edc:nzwidth="0x1" edc:desc="Free Run Mode">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Normal Mode" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="ON" edc:desc="Free Run Mode: Never wait for any trigger." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PRESCAL" edc:nzwidth="0x8" edc:desc="Prescaler Rate Selection"/>
            <edc:SFRFieldDef edc:cname="STARTUP" edc:nzwidth="0x4" edc:desc="Start Up Time">
              <edc:SFRFieldSemantic edc:cname="SUT0" edc:desc="0 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="SUT8" edc:desc="8 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="SUT16" edc:desc="16 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="SUT24" edc:desc="24 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="SUT64" edc:desc="64 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="SUT80" edc:desc="80 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="SUT96" edc:desc="96 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="SUT112" edc:desc="112 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x07"/>
              <edc:SFRFieldSemantic edc:cname="SUT512" edc:desc="512 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x08"/>
              <edc:SFRFieldSemantic edc:cname="SUT576" edc:desc="576 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x09"/>
              <edc:SFRFieldSemantic edc:cname="SUT640" edc:desc="640 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x0A"/>
              <edc:SFRFieldSemantic edc:cname="SUT704" edc:desc="704 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x0B"/>
              <edc:SFRFieldSemantic edc:cname="SUT768" edc:desc="768 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x0C"/>
              <edc:SFRFieldSemantic edc:cname="SUT832" edc:desc="832 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x0D"/>
              <edc:SFRFieldSemantic edc:cname="SUT896" edc:desc="896 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x0E"/>
              <edc:SFRFieldSemantic edc:cname="SUT960" edc:desc="960 periods of ADCCLK" edc:when="(field &amp; 0xF) == 0x0F"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DIV1" edc:nzwidth="0x1" edc:desc="ADC Clock Prescaler Division forced to 1">
              <edc:SFRFieldSemantic edc:cname="NO_DIV1" edc:desc="The PRESCAL field is used to generate the ADC clock unless DIV3 is written to 1." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FORCE_DIV1" edc:desc="The ADC clock equals peripheral clock (PRESCAL and DIV3 fields have no effect)." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TRACKTIM" edc:nzwidth="0x4" edc:desc="Tracking Time"/>
            <edc:SFRFieldDef edc:cname="TRANSFER" edc:nzwidth="0x2" edc:desc="Transfer Period"/>
            <edc:SFRFieldDef edc:cname="DIV3" edc:nzwidth="0x1" edc:desc="ADC Clock Prescaler Division forced to 3">
              <edc:SFRFieldSemantic edc:cname="NO_DIV3" edc:desc="The PRESCAL field is used to generate the ADC clock unless DIV1 is written to 1." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FORCE_DIV3" edc:desc="The ADC clock equals peripheral clock/3 unless DIV1 is written to 1." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="USEQ" edc:nzwidth="0x1" edc:desc="Use Sequence Enable">
              <edc:SFRFieldSemantic edc:cname="NUM_ORDER" edc:desc="Normal Mode: The controller converts channels in a simple numeric order depending only on the channel index." edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="REG_ORDER" edc:desc="User Sequence Mode: The sequence respects what is defined in ADC_SEQR1 register and can be used to convert the same channel several times." edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="ADC" edc:cname="ADC_SEQR1" edc:nzwidth="0x20" edc:access="----nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:impl="0xFFFFFFF" edc:_addr="0x40038008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC">
            <edc:SFRFieldDef edc:cname="USCH1" edc:nzwidth="0x4" edc:desc="User Sequence Number 1"/>
            <edc:SFRFieldDef edc:cname="USCH2" edc:nzwidth="0x4" edc:desc="User Sequence Number 2"/>
            <edc:SFRFieldDef edc:cname="USCH3" edc:nzwidth="0x4" edc:desc="User Sequence Number 3"/>
            <edc:SFRFieldDef edc:cname="USCH4" edc:nzwidth="0x4" edc:desc="User Sequence Number 4"/>
            <edc:SFRFieldDef edc:cname="USCH5" edc:nzwidth="0x4" edc:desc="User Sequence Number 5"/>
            <edc:SFRFieldDef edc:cname="USCH6" edc:nzwidth="0x4" edc:desc="User Sequence Number 6"/>
            <edc:SFRFieldDef edc:cname="USCH7" edc:nzwidth="0x4" edc:desc="User Sequence Number 7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
