Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg51/edc/ATSAMG51N18.PIC
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_SR" edc:nzwidth="0x20" edc:access="-----------rrrrr-----rrrr---r-rr" edc:impl="0x1F078B" edc:_addr="0x400E0468">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:nzwidth="0x1" edc:desc="Main Crystal Oscillator Status"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:nzwidth="0x1" edc:desc="PLLA Lock Status"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:nzwidth="0x1" edc:desc="Master Clock Status"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="OSCSELS" edc:nzwidth="0x1" edc:desc="Slow Clock Oscillator Selection"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready Status"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready Status"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready Status"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:nzwidth="0x1" edc:desc="Main Oscillator Selection Status"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:nzwidth="0x1" edc:desc="Main On-Chip RC Oscillator Status"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Event"/>
            <edc:SFRFieldDef edc:cname="CFDS" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Status"/>
            <edc:SFRFieldDef edc:cname="FOS" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Fault Output Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_IMR" edc:nzwidth="0x20" edc:access="-------------rrr-----rrr----r-rr" edc:impl="0x7070B" edc:_addr="0x400E046C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="MOSCXTS" edc:nzwidth="0x1" edc:desc="Main Crystal Oscillator Status Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="LOCKA" edc:nzwidth="0x1" edc:desc="PLLA Lock Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MCKRDY" edc:nzwidth="0x1" edc:desc="Master Clock Ready Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="PCKRDY0" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 0 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PCKRDY1" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 1 Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="PCKRDY2" edc:nzwidth="0x1" edc:desc="Programmable Clock Ready 2 Interrupt Mask"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="MOSCSELS" edc:nzwidth="0x1" edc:desc="Main Oscillator Selection Status Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="MOSCRCS" edc:nzwidth="0x1" edc:desc="Main On-Chip RC Status Interrupt Mask"/>
            <edc:SFRFieldDef edc:cname="CFDEV" edc:nzwidth="0x1" edc:desc="Clock Failure Detector Event Interrupt Mask"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_FSMR" edc:nzwidth="0x20" edc:access="---------nnn--nnnnnnnnnnnnnnnnnn" edc:impl="0x73FFFF" edc:_addr="0x400E0470">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="FSTT0" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 0"/>
            <edc:SFRFieldDef edc:cname="FSTT1" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 1"/>
            <edc:SFRFieldDef edc:cname="FSTT2" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 2"/>
            <edc:SFRFieldDef edc:cname="FSTT3" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 3"/>
            <edc:SFRFieldDef edc:cname="FSTT4" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 4"/>
            <edc:SFRFieldDef edc:cname="FSTT5" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 5"/>
            <edc:SFRFieldDef edc:cname="FSTT6" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 6"/>
            <edc:SFRFieldDef edc:cname="FSTT7" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 7"/>
            <edc:SFRFieldDef edc:cname="FSTT8" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 8"/>
            <edc:SFRFieldDef edc:cname="FSTT9" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 9"/>
            <edc:SFRFieldDef edc:cname="FSTT10" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 10"/>
            <edc:SFRFieldDef edc:cname="FSTT11" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 11"/>
            <edc:SFRFieldDef edc:cname="FSTT12" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 12"/>
            <edc:SFRFieldDef edc:cname="FSTT13" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 13"/>
            <edc:SFRFieldDef edc:cname="FSTT14" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 14"/>
            <edc:SFRFieldDef edc:cname="FSTT15" edc:nzwidth="0x1" edc:desc="Fast Startup Input Enable 15"/>
            <edc:SFRFieldDef edc:cname="RTTAL" edc:nzwidth="0x1" edc:desc="RTT Alarm Enable"/>
            <edc:SFRFieldDef edc:cname="RTCAL" edc:nzwidth="0x1" edc:desc="RTC Alarm Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="LPM" edc:nzwidth="0x1" edc:desc="Low-power Mode"/>
            <edc:SFRFieldDef edc:cname="FLPM" edc:nzwidth="0x2" edc:desc="Flash Low-power Mode">
              <edc:SFRFieldSemantic edc:cname="FLASH_STANDBY" edc:desc="Flash is in Standby Mode when system enters Wait Mode" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="FLASH_DEEP_POWERDOWN" edc:desc="Flash is in Deep-power-down mode when system enters Wait Mode" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="FLASH_IDLE" edc:desc="Idle mode" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PMC" edc:cname="PMC_FSPR" edc:nzwidth="0x20" edc:access="----------------nnnnnnnnnnnnnnnn" edc:impl="0xFFFF" edc:_addr="0x400E0474">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PMC">
            <edc:SFRFieldDef edc:cname="FSTP0" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarityx"/>
            <edc:SFRFieldDef edc:cname="FSTP1" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarityx"/>
            <edc:SFRFieldDef edc:cname="FSTP2" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarityx"/>
            <edc:SFRFieldDef edc:cname="FSTP3" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarityx"/>
            <edc:SFRFieldDef edc:cname="FSTP4" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarityx"/>
            <edc:SFRFieldDef edc:cname="FSTP5" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarityx"/>
            <edc:SFRFieldDef edc:cname="FSTP6" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarityx"/>
            <edc:SFRFieldDef edc:cname="FSTP7" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarityx"/>
            <edc:SFRFieldDef edc:cname="FSTP8" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarityx"/>
            <edc:SFRFieldDef edc:cname="FSTP9" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarityx"/>
            <edc:SFRFieldDef edc:cname="FSTP10" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarityx"/>
            <edc:SFRFieldDef edc:cname="FSTP11" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarityx"/>
            <edc:SFRFieldDef edc:cname="FSTP12" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarityx"/>
            <edc:SFRFieldDef edc:cname="FSTP13" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarityx"/>
            <edc:SFRFieldDef edc:cname="FSTP14" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarityx"/>
            <edc:SFRFieldDef edc:cname="FSTP15" edc:nzwidth="0x1" edc:desc="Fast Startup Input Polarityx"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
